CFDEM/CFDEMcoupling/tutorials/cfdemPimple/heatTransferPatil/hw350_u1.20/CFD/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.01325e5;

boundaryField
{
    wall // group
    {
        type            fixedFluxPressure;
    }

    inlet
    {
        type            fixedFluxPressure;
    }

    outlet
    {
        type            totalPressure;
        p0              $internalField;
        value           $internalField;
    }
}

// ************************************************************************* //
