CFDEM/CFDEMcoupling/tutorials/cfdemPimple/heatTransferPatil/hw350_u1.20/CFD/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

dpdt                false;

mixture
{
    specie
    {
        nMoles      1;
        molWeight   28.01;
    }
    thermodynamics
    {
        Cp          1010;
        Hf          0;
    }
    equationOfState
    {
        rho         1.27;
    }
    transport
    {
        mu          2e-05;
        Pr          0.8;
    }
}

// ************************************************************************* //
