CFDEM/CFDEMcoupling/tutorials/cfdemPimple/heatTransferPatil/hw350_u1.20/CFD/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(
    {
        name                nozzle;
        patchInfo
        {
            type            wall;
        }
        constructFrom       set;
        set                 nozzle;
    }
);

// ************************************************************************* //
